УТ.ФБ_КоннекторШины/src/InformationRegisters/ш_ПисьмаДляОтправки/ш_ПисьмаДляОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ш_ПисьмаДляОтправки</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.ФБ_КоннекторШины/src/CommonModules/ш_РаботаСЭлектроннойПочтой/Module.bsl
Функция ПолучитьПрофиль()
	
	Параметры=Новый СТруктура;
	
	Разделитель = Найти(Параметры.АдресSMTP, ":");
	Если Разделитель > 0 Тогда
		АдресSMTP = Лев(Параметры.АдресSMTP,Разделитель-1); 
		Попытка 
			ПортSMTP = Число(Сред(Параметры.АдресSMTP,Разделитель+1));
		Исключение
			ПортSMTP = 25;
		КонецПопытки;
	Иначе
		АдресSMTP = Параметры.АдресSMTP;
		ПортSMTP = 25;
	КонецЕсли;
	                                   
	Разделитель = Найти(Параметры.АдресIMAP, ":");
	Если Разделитель > 0 Тогда
		АдресIMAP = Лев(Параметры.АдресIMAP,Разделитель-1); 
		Попытка 
			ПортIMAP = Число(Сред(Параметры.АдресIMAP,Разделитель+1));
		Исключение
			ПортIMAP = 993;
		КонецПопытки;
	Иначе
		АдресIMAP = Параметры.АдресIMAP;
		ПортIMAP = Параметры.ПортIMAP;
	КонецЕсли;
	
	// устанавливаем адрес POP3
	Разделитель = Найти(Параметры.АдресPOP3, ":");
	Если Разделитель > 0 Тогда
		АдресPOP3 = Лев(Параметры.АдресPOP3,Разделитель-1); 
		Попытка 
			ПортPOP3 = Число(Сред(Параметры.АдресPOP3,Разделитель+1));
		Исключение
			ПортPOP3 = 110;
		КонецПопытки;
	Иначе
		АдресPOP3 = Параметры.АдресPOP3;
		ПортPOP3 = 110;
	КонецЕсли;
	
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
	
	Если ЗначениеЗаполнено(АдресSMTP) Тогда
		ПочтовыйПрофиль.АдресСервераSMTP = АдресSMTP;
		ПочтовыйПрофиль.ПортSMTP		 = Число(ПортSMTP);
		Если ЗначениеЗаполнено(Параметры.ПользовательSMTP) Тогда
			ПочтовыйПрофиль.ПользовательSMTP = Параметры.ПользовательSMTP;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ПарольSMTP) Тогда
			ПочтовыйПрофиль.ПарольSMTP		 = Параметры.ПарольSMTP;
		КонецЕсли;
		SMTPАутентификации = Параметры.СпособSMTPАвторизации;
		Если ЗначениеЗаполнено(SMTPАутентификации) Тогда
			ПочтовыйПрофиль.АутентификацияSMTP  = СпособSMTPАутентификации[SMTPАутентификации];
		КонецЕсли;
		ПочтовыйПрофиль.ИспользоватьSSLSMTP = Параметры.ИспользоватьSSLSMTP;
		ПочтовыйПрофиль.Таймаут = 30;
	Иначе
		//если выставить этот флаг, то 1С требует указания обоих адресов как POP3 так и SMTP
		ПочтовыйПрофиль.POP3ПередSMTP = Параметры.POP3передSMTP; 
		ПочтовыйПрофиль.ПортSMTP = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресIMAP) Тогда
		ПочтовыйПрофиль.АдресСервераIMAP = АдресIMAP;
		ПочтовыйПрофиль.ПортIMAP		 = Число(ПортIMAP);
		Если ЗначениеЗаполнено(Параметры.ПользовательIMAP) Тогда
			ПочтовыйПрофиль.ПользовательIMAP = Параметры.ПользовательIMAP;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ПарольIMAP) Тогда
			ПочтовыйПрофиль.ПарольIMAP		 = Параметры.ПарольIMAP;
		КонецЕсли;
		ПочтовыйПрофиль.ИспользоватьSSLIMAP = Параметры.ИспользоватьSSLIMAP;
	Иначе
		ПочтовыйПрофиль.ПортSMTP = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресPOP3) Тогда
		ПочтовыйПрофиль.АдресСервераPOP3 = АдресPOP3;
		ПочтовыйПрофиль.ПортPOP3		 = Число(ПортPOP3);
		ПочтовыйПрофиль.Пользователь	 = Параметры.ПользовательPOP3;
		ПочтовыйПрофиль.Пароль			 = Параметры.ПарольPOP3;
		POP3Аутентификации 		         = Параметры.СпособPOP3Авторизации;
		Если ЗначениеЗаполнено(POP3Аутентификации) Тогда
			ПочтовыйПрофиль.АутентификацияPOP3   = СпособPOP3Аутентификации[POP3Аутентификации];
		КонецЕсли;
	Иначе
		ПочтовыйПрофиль.ПортPOP3 = 0;
	КонецЕсли;
	
	//{{ ФБ Вавилов Н. 10.10.2018 Наряд № 0000040202
	ПочтовыйПрофиль.ИспользоватьSSLIMAP = Параметры.ИспользоватьSSLIMAP; 
	ПочтовыйПрофиль.ИспользоватьSSLSMTP = Параметры.ИспользоватьSSLSMTP;
	//}} ФБ Вавилов Н. 10.10.2018 Наряд № 0000040202
	
	Возврат ПочтовыйПрофиль;
	
КонецФункции

Процедура ОтправитьПисьмо(АдресПочты,Тема,Текст,Идентификатор=Неопределено, Файлы = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(АдресПочты) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Профиль = ПолучитьПрофиль();
		
		Если Профиль = Неопределено тогда
			ЗаписьЖурналаРегистрации("Рассылка", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка создания почтового профиля по заданию."+Символы.ПС+ш_РаботаСшинойДанныхСервер.СформироватьОписаниеОшибки(ИнформацияОбОшибке()));
			возврат;
		КонецЕсли;
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = Тема;
		
		Если Файлы <> неопределено Тогда
			Попытка
				Для каждого стрФайл Из Файлы Цикл
	        		Письмо.Вложения.Добавить(стрФайл.Значение,стрФайл.Ключ);
				КонецЦикла;
	   		Исключение
	        	Текст = Текст + "Не удалось добавить вложение! " + ш_РаботаСшинойДанныхСервер.СформироватьОписаниеОшибки(ИнформацияОбОшибке()) + Символы.ПС;
			КонецПопытки;
		КонецЕсли;

		Письмо.Тексты.Добавить(Текст, ?(Найти(Текст, "!DOCTYPE")>0 или Найти(Текст, "<META content=")>0, ТипТекстаПочтовогоСообщения.HTML, Неопределено));
		Письмо.Отправитель.Адрес = Профиль.ПользовательSMTP;
		Письмо.Отправитель.ОтображаемоеИмя = "";
		Письмо.ИмяОтправителя = "";
		
		//Письмо.Получатели.Добавить(АдресПочты,ТипТекстаПочтовогоСообщения.HTML);
		
		Почта = Новый ИнтернетПочта;
		Почта.Подключиться(Профиль,ПротоколИнтернетПочты.IMAP);
		Почта.Послать(Письмо);
		Почта.Отключиться();
		
		Если НЕ Идентификатор=Неопределено Тогда
			рег=РегистрыСведений.ш_ПисьмаДляОтправки.СоздатьМенеджерЗаписи();
			рег.Идентификатор=Идентификатор;
			рег.Удалить();
		КонецЕсли;
	Исключение
		Если Идентификатор=Неопределено Тогда
			
			ВложенияДляСохранения=Новый Соответствие;
			Для каждого стрВложение Из Письмо.Вложения Цикл
				ВложенияДляСохранения.Вставить(стрВложение.ИмяФайла,стрВложение.Данные);
			КонецЦикла;
			
			рег=РегистрыСведений.ш_ПисьмаДляОтправки.СоздатьМенеджерЗаписи();
			рег.Идентификатор=Новый УникальныйИдентификатор;
			рег.Текст=Текст;
			рег.АдресПочты=АдресПочты;
			рег.Тема=Тема;
			рег.Вложения=Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(ВложенияДляСохранения));
			рег.Записать(Истина);
			
		КонецЕсли;
		ЗаписьЖурналаРегистрации("Рассылка", УровеньЖурналаРегистрации.Ошибка, РегистрыСведений.ФБ_ПисьмаДляОтправки,,"Ошибка отправки сообщения по адресу """+АдресПочты+""": "+Символы.ПС+ш_РаботаСшинойДанныхСервер.СформироватьОписаниеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьПисьмоКОтправке(АдресПочты,Тема,Текст,Файлы=Неопределено) Экспорт
	
	рег=РегистрыСведений.ш_ПисьмаДляОтправки.СоздатьМенеджерЗаписи();
	рег.Идентификатор=Новый УникальныйИдентификатор;
	рег.Текст=Текст;
	рег.АдресПочты=АдресПочты;
	рег.Тема=Тема;
	рег.Вложения=Новый ХранилищеЗначения(Файлы);
	рег.Записать(Истина);
	
КонецПроцедуры

Процедура ОтправкаНеотправленныхПисем() Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПисьмаДляОтправки.Идентификатор КАК Идентификатор,
	             |	ПисьмаДляОтправки.Текст КАК Текст,
	             |	ПисьмаДляОтправки.АдресПочты КАК АдресПочты,
	             |	ПисьмаДляОтправки.Тема КАК Тема,
	             |	ПисьмаДляОтправки.Вложения КАК Вложения
	             |ИЗ
	             |	РегистрСведений.ш_ПисьмаДляОтправки КАК ПисьмаДляОтправки";
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ФайлыДляОтправки=Выборка.Вложения.Получить();
		Если НЕ ФайлыДляОтправки=Неопределено Тогда
			ФайлыДляОтправки=ЗначениеИзСтрокиВнутр(ФайлыДляОтправки);
		КонецЕсли;
		
		ОтправитьПисьмо(Выборка.АдресПочты,Выборка.Тема,Выборка.Текст,Выборка.Идентификатор,ФайлыДляОтправки);
	КонецЦикла;
	
КонецПроцедуры
